package task4;

public class Main {
    public static void main(String[] args) {
        //Chat деген класс тузунуз, полелери (name, isNew(boolean), dateOfIssue, designColor),
        //methods:
        //getChatName(){}; chat тын атын жана тусун чыгарып берсин.
        //getIsNewChat(){}; эгерде акыркы 5 жылдын аралыгында чыксы true, болбосо false
        //кайтарсын.
        // Аларды мурастаган WhatsApp, Telegram, Instagram, Slack жана башкалар. Ар бир
        //класста 2 ден уникалдуу полелери болсун жана parent class тын методторун
        //переопределять этиши керек. Ар бир мурастап жаткан класстын озуно тиешелуу
        //методу болсун, ошол гана класстын эмне кылып жатканын жана кандай
        //озгочолуктору бар экенин кайтарып берчу.
        // main ден ар бир класстын бир нече объектин тузуп баарын массивге салыныз.
        //Метод тузунуз бизге параметрден келген чаттардын арасынан эн жаны чатты
        //табып, анан чаттын атын жана “ эн жаны чат” деп консолго чыгарып берсин
    }
}
